In [3]:
import pandas  as pd
import numpy as np
import boto3
import psycopg2
import configparser

In [4]:
config = configparser.ConfigParser()
config.read('escec.cfg')

['escec.cfg']

In [5]:
RDS_HOST = 'banco.chsado2c29rj.us-east-1.rds.amazonaws.com'
print(RDS_HOST)

banco.chsado2c29rj.us-east-1.rds.amazonaws.com

In [6]:
postgres_driver = f"""postgresql://{config.get('RDS', 'DB_USER')}:{config.get('RDS', 'DB_PASSWORD')}@{RDS_HOST}:{config.get('RDS', 'DB_PORT')}/{config.get('RDS', 'DB_NAME')}"""

### Lectura de archivo desde s3

In [7]:
s3 = boto3.resource(
    service_name = 's3',
    region_name = 'us-east-1',
    aws_access_key_id = config.get('IAM', 'ACCESS_KEY'),
    aws_secret_access_key = config.get('IAM', 'SECRET_ACCESS_KEY')
)

In [20]:
for bucket in s3.buckets.all():
    S3_BUCKET_NAME = bucket.name
    print(bucket.name)

bucket-p2-23006412
bucket-v-23006412

In [21]:
S3_BUCKET_NAME = 'bucket-p2-23006412'

In [22]:
#extraemos todo lo que está en el bucket
remoteFileList = []
for objt in s3.Bucket(S3_BUCKET_NAME).objects.all():
    remoteFileList.append(objt.key)

remoteFileList

['conversion_euro_dolar.xlsx']

##### leemos data de S3

In [63]:
import io

for remoteFile in remoteFileList:
    try:
        file = s3.Bucket(S3_BUCKET_NAME).Object(remoteFile).get()
        data = file['Body'].read()
        df_valor_divisas = pd.read_excel(io.BytesIO(data), engine='openpyxl')
    except Exception as ex:
        print("No es un archivo.")
        print(ex)

df_valor_divisas.head()

  Mondeda_A Mondeda_B  Cambio
0     Euros   Dolares    1.08

### Usamos datos de s3 dentro las tablas de transacción

In [14]:
sql_query = 'SELECT "NOMEM", "SALAR" FROM "EMPLEADOS";'
df_empleados = pd.read_sql(sql_query, postgres_driver)
df_empleados.head()

     NOMEM  SALAR
0    CESAR   1800
1    MARIO   1900
2  LUCIANO   1500
3    JULIO   2600
4    AUREO   1800

In [24]:
sql_query = '''SELECT "NOMEM", "SALAR" FROM "EMPLEADOS";'''
df_montos = pd.read_sql(sql_query, postgres_driver)
df_montos.head()

     NOMEM  SALAR
0    CESAR   1800
1    MARIO   1900
2  LUCIANO   1500
3    JULIO   2600
4    AUREO   1800

In [25]:
sql_query = '''SELECT * FROM "EMPLEADOS";'''
df_divisas = pd.read_sql(sql_query, postgres_driver)
df_divisas.head()

   NUMEM  EXTEL     FECNA     FECIN  SALAR COMIS  NUMHI    NOMEM  NUMDE
0    110    350  19701011  19850215   1800  NULL      3    CESAR    121
1    120    840  19680906  19880110   1900   110      1    MARIO    112
2    130    810  19650909  19810102   1500   110      2  LUCIANO    112
3    150    340  19721008  19970115   2600  NULL      0    JULIO    121
4    160    740  19800907  20051111   1800   110      2    AUREO    111

In [76]:
import io
import pandas as pd
import boto3

for remoteFile in remoteFileList:
        try:
            file = s3.Bucket(S3_BUCKET_NAME).Object(remoteFile).get()
            data = file['Body'].read()
            df_valor_divisas = pd.read_excel(io.BytesIO(data), engine='openpyxl')
        except Exception as ex:
            print("No es un archivo.")
            print(ex)

# Query employee data from PostgreSQL and load into a dataframe
sql_query = 'SELECT "NOMEM", "SALAR" FROM "EMPLEADOS";'
df_empleados = pd.read_sql(sql_query, postgres_driver)

# Merge dataframes based on "Cambio" column
df_merged = df_valor_divisas['Cambio'].values[0] * df_empleados["SALAR"]

# Display resulting dataframe
print(df_merged)

0     1944.0
1     2052.0
2     1620.0
3     2808.0
4     1944.0
5     3024.0
6     1890.0
7     2062.8
8     1890.0
9     2062.8
10    1836.0
Name: SALAR, dtype: float64

In [77]:
len(df_merged)

11

In [79]:
df_divisas.shape

(11, 9)

In [80]:
df_divisas['SALAR_DOLAR'] = df_merged
df_divisas.head()

,NUMEM,EXTEL,FECNA,FECIN,SALAR,COMIS,NUMHI,NOMEM,NUMDE,SALAR_DOLAR
0,110,350,19701011,19850215,1800,NULL,3,CESAR,121,1944.0
1,120,840,19680906,19880110,1900,110,1,MARIO,112,2052.0
2,130,810,19650909,19810102,1500,110,2,LUCIANO,112,1620.0
3,150,340,19721008,19970115,2600,NULL,0,JULIO,121,2808.0
4,160,740,19800907,20051111,1800,110,2,AUREO,111,1944.0